alplabai/gd32-bridge-firmware/hal/gd32/adc_stream.c
	/* THE v0.2.3 got==0 root cause: CTL1.DMA alone stops issuing
     * requests after one DMA run.  CTL1.DDM (request-after-last) keeps
     * the request line live so the circular channel refills forever --
     * the vendor reference enables BOTH, in this order. */
	adc_dma_request_after_last_enable(ch->periph);
	adc_dma_mode_enable(ch->periph);

	/* Clear any End-Of-Conversion left by a prior single-shot
     * bridge_hw_adc_read on this peripheral BEFORE the converter
     * re-enables -- a stale EOC otherwise fires one spurious DMA
     * beat the moment the request unmasks, depositing a phantom
     * zeroth sample and desynchronising the ring cursor.  ROVF gets
     * the same treatment: overflow detection is live the instant
     * ADCON sets (DMA is already enabled above), and a session-stale
     * ROVF left set would stall conversion before the first sample
     * (UM Rev1.2 17.4.12, p.431-432; #44). */
	adc_flag_clear(ch->periph, ADC_FLAG_EOC);
	adc_flag_clear(ch->periph, ADC_FLAG_ROVF);
	adc_enable(ch->periph);
	for (volatile uint32_t stab = 0u; stab < 4096u; ++stab) {
		/* tSTAB dwell after ADCON, same bound adc_periph_init uses */
	}
	/* Recalibrate after the ADCON toggle above -- see the disable/
     * enable comment at the top of this bracket (#34).  Bounded, cost
     * ~25 us (adc.c's bridge_hw_adc_read carries the full derivation);
     * a false return means the calibration FSM never finished, so
     * fail the begin rather than arm a stream on an unproven
     * converter -- the DMA channel + lap ISR are not armed yet at
     * this point, so there is no live stream state to unwind.
     *
     * DISCLOSURE (#34 review): this is one of three request-path call
     * sites (the others: bridge_hw_adc_read in adc.c, and
     * adc_stream_recover_rovf below) that now pay calibration's
     * ~200000-iteration wedged-FSM worst case on every invocation,
     * not just once at boot -- see adc.c's bridge_hw_adc_read for the
     * full disclosure and the decision not to shorten the bound. */
	if (!adc_calibrate_bounded(ch->periph)) {
		/* Release the converter claim before bailing (#133 x #80).
         * Neither change has this hazard alone -- #80 added this early
         * return, #133 added the claim above it, and the MERGE is what
         * puts a return inside the claimed window.  Leaking the claim
         * here would leave adc_periph_busy[] set forever: every later
         * bridge_hw_adc_read and stream_begin on this converter would
         * answer BRIDGE_HW_ERR_BUSY, reboot-only recovery, from a single
         * calibration failure. */
		adc_periph_release(ch->periph);
		return BRIDGE_HW_ERR_IO;
	}

	/* Arm the lap counter BEFORE the channel starts: clear any stale
	 * full-transfer flag from a prior session on this controller, then
	 * enable the FTF interrupt + its NVIC line so EVERY ring reload is
	 * counted -- the overrun detection in stream_read is exact
	 * total-written-vs-read accounting, not a heuristic. */
	s->lap_count = 0u;
	dma_flag_clear(s->dma_periph, (dma_channel_enum)s->dma_channel, DMA_FLAG_FTF);
	dma_interrupt_enable(s->dma_periph, (dma_channel_enum)s->dma_channel, DMA_INT_FTF);
	nvic_irq_enable((s->dma_periph == DMA0) ? DMA0_Channel0_IRQn : DMA1_Channel0_IRQn,
	                ADC_STREAM_LAP_IRQ_PRIO,
	                ADC_STREAM_LAP_IRQ_SUBPRIO);

	dma_channel_enable(s->dma_periph, (dma_channel_enum)s->dma_channel);

	/* Route the pacing timer's update-event TRGO0 to this converter's
     * routine trigger, then run the timer at the requested rate.  Two
     * prescaler regimes keep the 16-bit period in range: a 1 MHz tick
     * covers 16 Hz..100 kHz exactly where it matters; below 16 Hz a
     * 10 kHz tick stretches to 1 Hz.  Division truncates -- worst-case
     * quantisation is one tick (documented in the protocol spec). */
	rcu_periph_clock_enable(RCU_TRIGSEL);
	trigsel_init(adc_stream_routrg(ch->periph),
	             (stream_id == 0u) ? TRIGSEL_INPUT_TIMER5_TRGO0 : TRIGSEL_INPUT_TIMER6_TRGO0);

	rcu_periph_clock_enable((stream_id == 0u) ? RCU_TIMER5 : RCU_TIMER6);
	timer_deinit(s->pace_timer);
	uint32_t psc, period_ticks;
	if (sample_rate_hz >= 16u) {
		psc          = (BRIDGE_ADC_PACE_CLK_HZ / 1000000u) - 1u; /* 1 MHz tick  */
		period_ticks = 1000000u / sample_rate_hz;                /* 10..62500   */
	} else {
		psc          = (BRIDGE_ADC_PACE_CLK_HZ / 10000u) - 1u; /* 10 kHz tick */
		period_ticks = 10000u / sample_rate_hz;                /* 667..10000  */
	}
	timer_parameter_struct tp;
	timer_struct_para_init(&tp);
	tp.prescaler = (uint16_t)psc;
	tp.period    = period_ticks - 1u;
	timer_init(s->pace_timer, &tp);
	timer_master_output0_trigger_source_select(s->pace_timer, TIMER_TRI_OUT0_SRC_UPDATE);
	timer_enable(s->pace_timer);

	s->in_use  = true;
	s->channel = channel;
	/* Snapshot the full-scale for the mv math so a mid-stream
	 * bridge_hw_adc_configure (which only rewrites the cache) can't
	 * change the divisor under a running stream -- the converter keeps
	 * the format this begin applied until stream_end. */
	s->full_scale   = adc_full_scale_for_bits(adc_resolution_bits_cache[channel]);
	s->read_idx     = 0u;
	s->total_read   = 0u; /* lap_count zeroed above, pre-arm */
	s->dsp_chain_id = 0u;
	s->dsp_bound    = false;
	s->dsp_cfg_bad  = false; /* gh#35 sticky flags: clean slate per session */
	s->dsp_sat      = false;
	/* Reconfigure done and in_use published: hand the converter's
     * short-term claim back (#133).  From here the in_use scan in
     * bridge_hw_adc_read is what keeps single-shot reads off this
     * converter, for as long as the stream runs. */
	adc_periph_release(ch->periph);
	return BRIDGE_HW_OK;
}

/* Recover the ADC from a routine-data overflow (#44) -- the 9-step
 * sequence UM Rev1.2 17.4.12 (p.431-432) documents.  Steps 2 and 7
 * toggle ADCON, which invalidates the calibration factor the same way
 * stream_begin's disable/enable does (#34): recalibrate before
 * returning so the stream resumes on a proven converter, not merely
 * an unstalled one.  DDM (request-after-last) and the external-
 * trigger routine config are untouched by this sequence and the
 * pacing timer never stopped, so step 9 ("start conversion") needs no
 * explicit call here -- the next TRGO edge resumes conversion once
 * ADCON is back.  Returns false only if the recalibration's bounded
 * spin never completes (the converter itself stayed wedged).
 *
 * DISCLOSURE (#34 review): this is the third of three request-path
 * call sites that now pay adc_calibrate_bounded's ~200000-iteration
 * wedged-FSM worst case on every invocation rather than once at boot
 * -- see adc.c's bridge_hw_adc_read for the full disclosure and the
 * decision not to shorten the bound.
 *
 * The DMA full-transfer-finish (FTF) interrupt flag is cleared as
 * part of step 3's "reinit DMA module": ROVF and a ring-wrap FTF can
 * land in the same window (this handler runs at CS-EXTI priority 1,
 * which blocks the priority-3 lap ISR -- DMA0/1_Channel0_IRQHandler
 * above -- from running until this function returns), and a FTF left
 * pending here fires the instant this handler returns, bumping
 * lap_count against a total_read the caller is about to re-anchor to
 * "0 new samples since recovery" -- the next poll would then
 * misreport a full-ring loss it didn't actually see (the #18 phantom-
 * loss class).  UM Rev1.2 §8.4.8 (p.295): the flag lives in DMA_INTF,
 * cleared via the dedicated bit in DMA_INTC (FTFIFC) -- disabling
 * CHEN does not clear it, so it needs its own clear here. */
static bool adc_stream_recover_rovf(adc_stream_state_t *s, const gd32_adc_ch_t *ch)
{
	adc_dma_mode_disable(ch->periph); /* 1. Clear DMA bit of ADC_CTL1. */
	adc_disable(ch->periph);          /* 2. Clear ADCON bit of ADC_CTL1. */

	/* 3. Clear CHEN bit of DMA_CHxCTL, reinit the DMA module.  The
	 * count register is reloaded to the full ring length explicitly:
	 * an overflow almost certainly caught the channel mid-ring rather
	 * than exactly at a circular-reload boundary.  A stale FTF (see
	 * the function comment above) is cleared here too, alongside the
	 * rest of the reinit, before the channel comes back up. */
	dma_channel_disable(s->dma_periph, (dma_channel_enum)s->dma_channel);
	dma_transfer_number_config(
	    s->dma_periph, (dma_channel_enum)s->dma_channel, BRIDGE_ADC_STREAM_RING_SAMPLES);
	dma_interrupt_flag_clear(s->dma_periph, (dma_channel_enum)s->dma_channel, DMA_INT_FLAG_FTF);

