alplabai/gd32-bridge-firmware/hal/gd32/adc_stream.c
	/* Release the DSP chain bound to this stream back to the pool.
     * chain_open is the ONLY allocator (sets in_use=true) and nothing
     * else clears it, so without this the 4-slot pool leaks one chain
     * per bind->end cycle -- after BRIDGE_DSP_MAX_CHAINS cycles
     * chain_open returns NOSUPPORT forever until a reboot (#496).
     * dsp_chain_id is only meaningful while dsp_bound, so gate on it. */
	if (s->dsp_bound) {
		adc_dsp_fac_release(stream_id); /* free the FAC if this stream owned it */
		adc_dsp_fft_release(stream_id); /* free the FFT if this stream owned it */
		adc_dsp_chain_release(s->dsp_chain_id);
	}

	s->in_use      = false;
	s->dsp_bound   = false;
	s->dsp_cfg_bad = false; /* gh#35: sticky flags live exactly one session */
	s->dsp_sat     = false;
	return restored ? BRIDGE_HW_OK : BRIDGE_HW_ERR_IO;
}

/* v0.5 (§2B wave-2) chunked DSP-chain upload -- the pool, chain_open,
 * stage_push, adc_dsp_stage_blob_valid, chain_release and chain_bind
 * (plus the shared adc_dsp_chain_p1_capable() capability predicate and
 * the FAC/FFT busy checks it and chain_bind both use) now live in
 * adc_dsp_chain.c (#69/#70 host-testability split -- see that file's
 * header comment).  adc_dsp_chain.h, included above, is this file's
 * only remaining dependency on that pool: the pump-side config
 * functions below index `adc_dsp_chains[]` directly to decode a bound
 * chain's stage blobs before programming the FAC/FFT registers. */

/* =====================================================================
 * #496 FAC FIR/IIR runtime dispatch -- the filtered data plane.
 *
 * A bound FIR/IIR chain routes the raw ADC stream through the GD32 FAC
 * hardware filter (first-lit 2026-07-13: coeffs in X1, DEEP X0 input
 * buffer, clip-enabled, batch or streaming).  The FILTER runs in the
 * base-level pump (bridge_hw_dsp_pump, from the main WFI loop) -- NEVER
 * in stream_read (the CS-EXTI transport handler, prio 1) where even a
 * modest FIR would add link latency (the 2026-06-04 link-rot mode).
 *
 * There is ONE FAC block, so ONE filter stream may be bound at a time;
 * chain_bind rejects a second filter chain with NOSUPPORT
 * (adc_dsp_chain.c: adc_dsp_filter_stream_busy()).
 * ===================================================================== */

/* stream_id currently loaded into the FAC, or -1 when the FAC is idle. */
static int8_t adc_dsp_fac_owner = -1;

/* Release the FAC if this stream owned it (called from stream_end). */
void adc_dsp_fac_release(uint8_t stream_id)
{
	if (adc_dsp_fac_owner == (int8_t)stream_id) {
		fac_stop();
		adc_dsp_fac_owner = -1;
	}
}

/* Decode one wire coefficient (4 bytes little-endian, Q31 or F32) into
 * the FAC's Q15 fixed-point.  Q31 -> arithmetic >>16; F32 -> clamp to
 * [-1, +1) and scale by 2^15.
 *
 * gh#35 fix 2: `g` is the section's headroom exponent -- the FAC's
 * accumulator gain IPR multiplies the accumulator output by 2^IPR
 * (UM Rev1.2 p.1505 s35.3.6: "The parameter IPR is the gain, applied
 * to the accumulator output by multiplied 2IPR, where IPR is in the
 * range [0:7]"), so coefficients delivered to local memory are scaled
 * DOWN by 2^g and the gain buys the factor back.  This is exactly the
 * mechanism AN208 p.13 prescribes ("To make full use of these data,
 * the above parameters are scaled up by 16384") and the vendor
 * Iir_dma example uses with iir_gain = 1.  Without it, any |coeff| >=
 * 1.0 -- routine for a lightly damped biquad, whose a1 routinely sits
 * between -1 and -2 -- was silently clamped onto the q1.15 rail,
 * changing the filter's cutoff and Q with no error anywhere on the
 * wire.  g == 0 keeps this identical to the pre-gh#35 decode. */
static int16_t adc_dsp_f32_to_q15(float f, uint8_t g)
{
	f = f / (float)(1u << g);
	if (f >= 1.0f) f = 0.999969f;
	if (f <= -1.0f) f = -1.0f;
	return (int16_t)(f * 32768.0f);
}

/* Negate a q1.15 feedback coefficient.  gh#35 fix 1: the wire contract
 * (<alp/dsp.h>) is y[n] = b*x - a*y, but the FAC ADDS the feedback
 * term (UM Rev1.2 p.1505 eq.(35-2): "yn = 2IPR (sum(xn-k x bk) +
 * sum(yn-k x ak))"), so a1/a2 must be sign-reversed at decode or every
 * biquad's poles come out mirrored -- a filter designed stable can be
 * realised unstable.  Both the negation and the halving are confirmed
 * by the vendor Iir_dma example (main.c:58-60 + ipr=1 at :205).  The
 * INT16_MIN case clamps to INT16_MAX because -(-32768) is not
 * representable in int16_t.  Do NOT "fix" the sign back. */
static int16_t adc_dsp_neg_q15(int16_t v)
{
	return (v == INT16_MIN) ? INT16_MAX : (int16_t)(-v);
}

/* Largest |coefficient| across a section's F32 values, for the
 * headroom exponent.  Returns a negative value (-1.0f) to signal
 * "out of FAC range": max|coeff| >= 128 needs g = 7 and still does
 * not fit, which is where gh#35 draws the line -- refuse the chain
 * (sticky, surfaced through stream_read as RANGE) instead of silently
 * clamping onto the rail. */
#define ADC_DSP_FAC_COEFF_MAX 128.0f

static float adc_dsp_f32_max_abs(const float *v, uint8_t n)
{
	float max = 0.0f;
	for (uint8_t k = 0u; k < n; ++k) {
		const float a = (v[k] < 0.0f) ? -v[k] : v[k];
		if (a > max) max = a;
	}
	return (max >= ADC_DSP_FAC_COEFF_MAX) ? -1.0f : max;
}

/* Smallest g in [0,7] with max/2^g <= 1, so no coefficient lands on
 * the q1.15 rail (caller has already rejected max >= 128, so g = 7
 * always suffices; the max == 2^g edge clamps to 0.999969, a 3e-5
 * gain error that is the plane's own resolution). */
static uint8_t adc_dsp_headroom_exp(float max_abs)
{
	uint8_t g = 0u;
	while (g < 7u && max_abs > (float)(1u << g))
		++g;
	return g;
}

/* Configure the FAC for stream s's bound chain (single FIR or single-
 * section IIR -- the only shapes chain_bind now lets through, see
 * adc_dsp_chain_p1_capable() in adc_dsp_chain.c).  Streaming mode:
 * coeffs preloaded into X1, no input preload -- the pump feeds X0 one
 * sample at a time.  chain_bind is where a caller now learns a chain
 * is unrealisable (BRIDGE_HW_ERR_NOTIMPL, #69) -- the `return false`
 * paths below are unreachable in normal operation once bind enforces
 * the shared predicate; they stay only as a defence-in-depth guard
 * against the two sides drifting apart again, in which case the
 * stream is simply left unfiltered. */
static bool adc_dsp_fac_config(const adc_stream_state_t *s)
{
	const adc_dsp_chain_t *chain = &adc_dsp_chains[s->dsp_chain_id];

	/* Defence in depth: chain_bind already refused any chain P1 can't
	 * realise via this SAME predicate -- re-checking it here means a
	 * future capability lift landing on only one side can't silently
	 * reopen the #69 hang.  Since #132 the predicate also re-runs
	 * adc_dsp_stage_blob_valid() over every populated stage, so it
	 * covers the PAYLOAD fields decoded below (the FIR tap count, the
	 * IIR section count, the FFT out_fmt) and not just the chain's
	 * shape -- which is what this comment always claimed. */
	if (!adc_dsp_chain_p1_capable(chain)) return false;

	/* P1 handles exactly one populated non-FFT stage (guaranteed by
	 * the capability check above; find it to decode its blob). */
	const adc_dsp_stage_t *st = 0;
	for (uint8_t i = 0u; i < BRIDGE_DSP_MAX_STAGES; ++i) {
		if (chain->stages[i].total_size != 0u) {
			st = &chain->stages[i];
			break;
		}
	}
	if (st == 0) return false; /* unreachable post-bind; kept as a defensive guard */

	fac_deinit();
	rcu_periph_clock_enable(RCU_FAC);

	fac_parameter_struct p;
	fac_struct_para_init(&p);
	const uint8_t depth = 32u; /* X0 working depth beyond the tap window */

