alplabai/gd32-bridge-firmware/hal/gd32/adc_stream.c
	if (st->kind == 0u) { /* FIR: format:u8 n_taps:u8 rsvd:u16 taps[] */
		const uint8_t fmt = st->data[0];
		const uint8_t nt  = st->data[1];
		/* Hard bound at the point of use (#132).  The predicate above
		 * already rejects nt == 0 or nt > BRIDGE_DSP_MAX_FIR_TAPS, so
		 * this cannot fire today -- it is here so the array index below
		 * is provably in range from THIS function alone, without the
		 * reader (or a future editor of adc_dsp_chain.c) having to
		 * carry the bound across a translation-unit boundary.  `taps`
		 * lives on the single 2 KB stack that also carries the I2C
		 * ISR's protocol_dispatch() and a nested CS-EXTI ISR, with no
		 * MSPLIM and no stack painting: an overflow here is silent. */
		if (nt == 0u || nt > BRIDGE_DSP_MAX_FIR_TAPS) return false;
		if (st->total_size != (uint16_t)(BRIDGE_DSP_STAGE_HDR_BYTES + (uint16_t)nt * 4u))
			return false;
		/* gh#35 fix 2: decode every tap, derive the section's headroom
		 * exponent from the largest magnitude, scale, and set IPR to
		 * buy the factor back.  Q31 values are inside [-1, 1) by
		 * construction so g collapses to 0 and the >>16 decode is
		 * exact; only F32 taps can exceed the q1.15 range.  A max >=
		 * 128 cannot be scaled into range even at g = 7 -- refuse
		 * (sticky, surfaced via stream_read as RANGE) rather than
		 * clamping onto the rail and serving a different filter with
		 * STATUS_OK. */
		int16_t taps[BRIDGE_DSP_MAX_FIR_TAPS];
		uint8_t g = 0u;
		float   fv[BRIDGE_DSP_MAX_FIR_TAPS];
		for (uint8_t k = 0u; k < nt; ++k) {
			const uint16_t off = (uint16_t)(BRIDGE_DSP_STAGE_HDR_BYTES + (uint16_t)k * 4u);
			const uint32_t w   = (uint32_t)st->data[off] | ((uint32_t)st->data[off + 1u] << 8) |
			                     ((uint32_t)st->data[off + 2u] << 16) |
			                     ((uint32_t)st->data[off + 3u] << 24);
			if (fmt == 1u) { /* Q31 */
				taps[k] = (int16_t)((int32_t)w >> 16);
			} else { /* F32 */
				__builtin_memcpy(&fv[k], &w, sizeof(fv[k]));
			}
		}
		if (fmt != 1u) {
			const float max = adc_dsp_f32_max_abs(fv, nt);
			if (max < 0.0f) return false; /* >= 128: out of FAC range */
			g = adc_dsp_headroom_exp(max);
			for (uint8_t k = 0u; k < nt; ++k)
				taps[k] = adc_dsp_f32_to_q15(fv[k], g);
		}
		p.coeff_addr       = 0u;
		p.coeff_size       = nt;
		p.input_addr       = nt;
		p.input_size       = (uint8_t)(nt + depth);
		p.output_addr      = (uint8_t)(nt + nt + depth);
		p.output_size      = depth;
		p.input_threshold  = FAC_THRESHOLD_1;
		p.output_threshold = FAC_THRESHOLD_1;
		p.clip             = FAC_CP_ENABLE;
		fac_init(&p);

		fac_fixed_data_preload_struct pl;
		fac_fixed_data_preload_init(&pl);
		pl.coeffb_ctx  = taps;
		pl.coeffb_size = nt;
		pl.coeffa_ctx  = 0;
		pl.coeffa_size = 0u;
		pl.input_ctx   = 0;
		pl.input_size  = 0u;
		pl.output_ctx  = 0;
		pl.output_size = 0u;
		fac_fixed_buffer_preload(&pl);

		p.func = FUNC_CONVO_FIR;
		p.ipp  = nt;
		p.ipq  = 0u;
		p.ipr  = g; /* accumulator gain 2^g buys the decode's scaling back */
		fac_function_config(&p);
		fac_start();
		return true;
	}

	if (st->kind == 1u) { /* IIR direct-form-1, SINGLE biquad in P1 -- the
	                       * n_sections == 1 limit is enforced by
	                       * adc_dsp_chain_p1_capable() above, not here. */
		const uint8_t fmt = st->data[0];
		/* section = b0,b1,b2,a1,a2 (5 coeffs).  FAC coeffb = feed-
		 * forward B (b0,b1,b2), coeffa = feedback A (a1,a2).
		 *
		 * gh#35 fixes 1 + 2 (they must land together -- both change
		 * the words written into FAC local memory): the feedback pair
		 * is NEGATED at decode (the FAC adds the feedback term, UM
		 * p.1505 eq.(35-2); the wire contract subtracts it), and all
		 * five coefficients are scaled down by the section's headroom
		 * exponent g with p.ipr = g buying the factor back.  Q31 is
		 * inside [-1, 1) by construction so g = 0.  max|coeff| >= 128
		 * refuses the whole config (sticky, surfaced via stream_read
		 * as RANGE). */
		int16_t        b[3], a[2];
		uint8_t        g = 0u;
		float          fv[5];
		const uint8_t *c = &st->data[BRIDGE_DSP_STAGE_HDR_BYTES];
		for (uint8_t k = 0u; k < 5u; ++k) {
			const uint32_t w = (uint32_t)c[k * 4u] | ((uint32_t)c[k * 4u + 1u] << 8) |
			                   ((uint32_t)c[k * 4u + 2u] << 16) | ((uint32_t)c[k * 4u + 3u] << 24);
			if (fmt == 1u) { /* Q31 */
				const int16_t v = (int16_t)((int32_t)w >> 16);
				if (k < 3u) {
					b[k] = v;
				} else {
					a[k - 3u] = adc_dsp_neg_q15(v);
				}
			} else { /* F32 */
				__builtin_memcpy(&fv[k], &w, sizeof(fv[k]));
			}
		}
		if (fmt != 1u) {
			const float max = adc_dsp_f32_max_abs(fv, 5u);
			if (max < 0.0f) return false; /* >= 128: out of FAC range */
			g = adc_dsp_headroom_exp(max);
			for (uint8_t k = 0u; k < 3u; ++k)
				b[k] = adc_dsp_f32_to_q15(fv[k], g);
			for (uint8_t k = 0u; k < 2u; ++k)
				a[k] = adc_dsp_neg_q15(adc_dsp_f32_to_q15(fv[3u + k], g));
		}
		p.coeff_addr       = 0u;
		p.coeff_size       = 5u; /* b0..b2,a1,a2 */
		p.input_addr       = 5u;
		p.input_size       = (uint8_t)(3u + depth);
		p.output_addr      = (uint8_t)(5u + 3u + depth);
		p.output_size      = depth;
		p.input_threshold  = FAC_THRESHOLD_1;
		p.output_threshold = FAC_THRESHOLD_1;
		p.clip             = FAC_CP_ENABLE;
		fac_init(&p);

		fac_fixed_data_preload_struct pl;
		fac_fixed_data_preload_init(&pl);
		pl.coeffb_ctx  = b;
		pl.coeffb_size = 3u;
		pl.coeffa_ctx  = a;
		pl.coeffa_size = 2u;
		pl.input_ctx   = 0;
		pl.input_size  = 0u;
		pl.output_ctx  = 0;
		pl.output_size = 0u;
		fac_fixed_buffer_preload(&pl);

		/* IPP = feed-forward count (3), IPQ = feedback count (2).
		 * IPR = g: the accumulator gain 2^g buys the decode scaling
		 * back (UM p.1505; vendor Iir_dma main.c:205 iir_gain = 1). */
		p.func = FUNC_IIR_DIRECT_FORM_1;
		p.ipp  = 3u;
		p.ipq  = 2u;
		p.ipr  = g;
		fac_function_config(&p);
		fac_start();
		return true;
	}

	return false; /* WINDOW/FFT are not filter terminals */
}

/* Drain stream sid's new raw samples through the FAC into its processed
 * ring.  Base-level producer of proc_ring + sole consumer of the raw
 * ring for this stream; mirrors stream_read's exact lap+write-index
 * backlog accounting so a mid-pump DMA reload can only UNDER-count. */
static void adc_dsp_pump_stream(uint8_t sid)
{
	adc_stream_state_t *s = &adc_streams[sid];

	if (adc_dsp_fac_owner != (int8_t)sid) {
		if (!adc_dsp_fac_config(s)) {
			/* gh#35: a config refusal is no longer silent.  The
			 * chain passed bind's shape checks but its
			 * coefficients are out of the FAC's realisable range
			 * (max|coeff| >= 128).  Mark the stream so
			 * stream_read answers RANGE instead of letting the
			 * pump idle forever on a bound chain that will never
			 * produce -- the #69 silent-starvation shape.  Sticky
			 * until stream_end: no auto-retry, the coefficients
			 * cannot change without a new chain_open. */
			s->dsp_cfg_bad = true;
			return;
		}
		adc_dsp_fac_owner = (int8_t)sid;
	}

	const uint32_t laps          = s->lap_count;
	const uint16_t w             = adc_stream_write_index(s);
	const uint32_t total_written = laps * BRIDGE_ADC_STREAM_RING_SAMPLES + (uint32_t)w;
	int32_t        avail         = (int32_t)(total_written - s->pump_raw_read);
	if (avail <= 0) return;
	if ((uint32_t)avail >= BRIDGE_ADC_STREAM_RING_SAMPLES) {
		/* The pump fell a full ring behind the DMA -- drop the corrupt
		 * backlog and resync so the next batch is gap-free (the host
		 * sees this as a proc-ring gap, same as a raw overrun). */
		s->pump_raw_read = total_written;
		return;
	}

