alplabai/gd32-bridge-firmware/hal/gd32/adc_stream.c
	while (avail-- > 0) {
		const uint16_t ridx = (uint16_t)(s->pump_raw_read % BRIDGE_ADC_STREAM_RING_SAMPLES);
		const uint16_t code = (uint16_t)(s->ring[ridx] & 0x0FFFu); /* 12-bit */
		s->pump_raw_read++;

		/* gh#35 fix 3: bias the input around mid-scale BEFORE the <<3.
		 * The old non-negative mapping (code << 3) was reasoned only
		 * about a unity-DC-gain low-pass; for any high-pass, band-
		 * pass or DC-blocking biquad the output is legitimately
		 * negative for about half the samples, and the old output
		 * clamp (c < 0 -> 0) half-wave-rectified the served stream --
		 * a large spurious DC term and harmonics the signal never
		 * contained, delivered with STATUS_OK.  With the bias, x is a
		 * signed q1.15 in [-1, 0.9995) centred on 0, the FAC output
		 * is signed symmetric, and the +2048 re-bias below maps a
		 * mid-scale-centred swing back onto the unipolar code plane
		 * WITHOUT discarding the negative half. */
		const int16_t x = (int16_t)(((int32_t)code - 2048) * 8);
		if (fac_flag_get(FAC_FLAG_X0BFF) == SET) break; /* FAC input saturated */
		fac_fixed_data_write(x);

		if (fac_flag_get(FAC_FLAG_YBEF) == RESET) {
			/* Re-bias the signed q1.15 output back onto the unipolar
			 * code plane (>>3 undoes the <<3 scale, +2048 undoes the
			 * mid-scale subtraction above).  Swings beyond one code
			 * half-range clip here -- the 12-bit processed plane's
			 * own headroom; genuine FAC saturation is flagged via
			 * dsp_sat below, so a clipped or railed series is never
			 * reported as STATUS_OK. */
			int32_t c = (((int32_t)fac_fixed_data_read()) >> 3) + 2048;
			if (c < 0) c = 0;
			if (c > 4095) c = 4095;
			/* gh#35: saturation visibility.  Poll the FAC's sticky
			 * error flags (UM p.1515 FAC_STAT STEF bit 10 = output
			 * saturation, GSTEF bit 11 = gain saturation) rather
			 * than arming their interrupt enables (STEIE/GSTEIE,
			 * p.1514) -- the pump runs at base level, no vector is
			 * needed, and polling cannot preempt the transports.
			 * Either flag means the served stream contains railed
			 * values: mark the stream sticky so stream_read stops
			 * answering STATUS_OK for it. */
			if (SET == fac_flag_get(FAC_FLAG_STEF) || SET == fac_flag_get(FAC_FLAG_GSTEF)) {
				s->dsp_sat = true;
			}
			s->proc_ring[s->proc_write % BRIDGE_ADC_STREAM_RING_SAMPLES] = (uint16_t)c;
			s->proc_write++;
		}
	}
}

/* Base-level DSP pump -- called every main-loop tick (bridge_hw_tick).
 * Services every bound FIR/IIR stream; FFT-bound streams have no filter
 * data plane (spectrum is pulled separately). */
void bridge_hw_dsp_pump(void)
{
	for (uint8_t sid = 0u; sid < BRIDGE_ADC_STREAM_COUNT; ++sid) {
		const adc_stream_state_t *s = &adc_streams[sid];
		if (!s->in_use || !s->dsp_bound) continue;
		if (s->dsp_terminal == 3u)
			adc_dsp_pump_fft(sid); /* spectrum path */
		else
			adc_dsp_pump_stream(sid); /* FIR/IIR path */
	}
}

/* =====================================================================
 * #496 FFT spectrum path -- WINDOW+FFT terminal chains.
 *
 * The GD32 FFT block (first-lit 2026-07-13; FLOAT real-in / complex-out)
 * transforms a full N-sample window of the ADC stream into a spectrum.
 * Like the FAC there is ONE block, so ONE FFT stream at a time.  The
 * base-level pump accumulates raw samples into a float window; when the
 * window fills it runs the HW FFT (HW-windowed if the chain has a WINDOW
 * stage), reduces to the requested output format, bumps a frame seq, and
 * refills.  The host pulls the latest frame with CMD_ADC_SPECTRUM_READ.
 * ===================================================================== */
/* F3 (review of #69/#70): this is a compile-time ALIAS of
 * BRIDGE_DSP_MAX_FFT_POINTS (adc_dsp_chain.h), not an independently-
 * maintained copy.  Before this fix the two were separately-defined
 * constants that happened to agree (both 1024) -- raising
 * BRIDGE_DSP_MAX_FFT_POINTS alone would have let chain_bind accept an
 * n_points the FFT buffers below are not sized for, so adc_dsp_fft_config
 * would then always fail post-bind and CMD_ADC_SPECTRUM_READ would
 * answer IO forever: the #69 silent-starvation shape, regenerated
 * through this one limit.  Aliasing makes that divergence impossible;
 * bumping the point cap is now a single-macro edit that resizes these
 * buffers automatically. */
#define ADC_DSP_FFT_MAX_POINTS BRIDGE_DSP_MAX_FFT_POINTS

static int8_t            adc_dsp_fft_owner = -1;
static uint16_t          adc_dsp_fft_points;
static uint8_t           adc_dsp_fft_outfmt; /* 0 complex / 1 mag / 2 mag-onesided */
static uint16_t          adc_dsp_fft_fill;
static volatile uint32_t adc_dsp_fft_seq;   /* completed-frame counter */
static uint16_t          adc_dsp_fft_nbins; /* bins in the current frame */
static float             adc_dsp_fft_real[ADC_DSP_FFT_MAX_POINTS];
static float             adc_dsp_fft_out[ADC_DSP_FFT_MAX_POINTS * 2u]; /* re,im */
static float             adc_dsp_fft_wcoef[ADC_DSP_FFT_MAX_POINTS];
static float             adc_dsp_fft_bins[ADC_DSP_FFT_MAX_POINTS * 2u]; /* published */

static uint8_t adc_dsp_fft_point_enum(uint16_t n)
{
	switch (n) {
	case 32u:
		return FFT_POINT_32;
	case 64u:
		return FFT_POINT_64;
	case 128u:
		return FFT_POINT_128;
	case 256u:
		return FFT_POINT_256;
	default:
		break;
	}
	/* 512 / 1024 continue the enum (see gd32g5x3_fft.h). */
	if (n == 512u) return (uint8_t)(FFT_POINT_256 + 1u);
	return (uint8_t)(FFT_POINT_256 + 2u); /* 1024 */
}

/* Fill the HW window coefficient buffer for a shape (0 rect => flat 1.0,
 * 1 Hann, 2 Hamming, 3 Blackman).  Symmetric window over N points. */
static void adc_dsp_fft_make_window(uint8_t shape, uint16_t n)
{
	const float twopi = 6.28318530718f;
	for (uint16_t i = 0u; i < n; ++i) {
		const float t = (float)i / (float)(n - 1u);
		float       w;
		switch (shape) {
		case 1u:
			w = 0.5f - 0.5f * __builtin_cosf(twopi * t);
			break; /* Hann    */
		case 2u:
			w = 0.54f - 0.46f * __builtin_cosf(twopi * t);
			break; /* Hamming */
		case 3u:
			w = 0.42f - 0.5f * __builtin_cosf(twopi * t) + 0.08f * __builtin_cosf(2.0f * twopi * t);
			break; /* Blackman*/
		default:
			w = 1.0f;
			break; /* rect    */
		}
		adc_dsp_fft_wcoef[i] = w;
	}
}

