alplabai/gd32-bridge-firmware/hal/gd32/adc_stream.c
/* Configure the FFT block + window for stream s's bound FFT chain.
 * chain_bind is now where a FIR/IIR-ahead-of-FFT shape is refused
 * (BRIDGE_HW_ERR_NOTIMPL, #69) -- the checks below are a defence-in-
 * depth re-check via the SAME shared predicate chain_bind uses, not
 * an independent copy of the "WINDOW+FFT only" limit. */
static bool adc_dsp_fft_config(const adc_stream_state_t *s)
{
	const adc_dsp_chain_t *chain = &adc_dsp_chains[s->dsp_chain_id];

	if (!adc_dsp_chain_p1_capable(chain)) return false;

	const adc_dsp_stage_t *fft_st = 0, *win_st = 0;
	for (uint8_t i = 0u; i < BRIDGE_DSP_MAX_STAGES; ++i) {
		if (chain->stages[i].total_size == 0u) continue;
		if (chain->stages[i].kind == 3u)
			fft_st = &chain->stages[i];
		else if (chain->stages[i].kind == 2u)
			win_st = &chain->stages[i];
		/* No other kind can be populated here -- guaranteed by the
		 * capability check above. */
	}
	if (fft_st == 0) return false; /* unreachable post-bind; kept as a defensive guard */

	const uint16_t n   = (uint16_t)(fft_st->data[0] | ((uint16_t)fft_st->data[1] << 8));
	const uint8_t  ofm = fft_st->data[2];
	/* F3 (review of #69/#70): adc_dsp_chain_p1_capable() above now folds
	 * in this same bound (BRIDGE_DSP_MIN_FFT_POINTS/MAX_FFT_POINTS,
	 * which ADC_DSP_FFT_MAX_POINTS aliases) -- unreachable post-bind,
	 * kept as a defensive guard against the two checks drifting apart. */
	if (n < BRIDGE_DSP_MIN_FFT_POINTS || n > ADC_DSP_FFT_MAX_POINTS) return false;

	adc_dsp_fft_points = n;
	adc_dsp_fft_outfmt = ofm;
	adc_dsp_fft_fill   = 0u;
	adc_dsp_fft_nbins  = 0u;

	const uint8_t shape = (win_st != 0) ? win_st->data[0] : 0u;

	fft_deinit();
	rcu_periph_clock_enable(RCU_FFT);
	fft_parameter_struct f;
	fft_struct_para_init(&f);
	f.mode_sel     = FFT_MODE;
	f.point_num    = adc_dsp_fft_point_enum(n);
	f.downsamp_sel = FFT_DOWNSAMPLE_1;
	f.image_source = FFT_IM_ZERO;
	f.real_addr    = (uint32_t)(uintptr_t)adc_dsp_fft_real;
	f.image_addr   = 0u;
	f.output_addr  = (uint32_t)(uintptr_t)adc_dsp_fft_out;
	if (win_st != 0 || shape != 0u) {
		adc_dsp_fft_make_window(shape, n);
		f.window_enable = FFT_WINDOW_ENABLE;
		f.window_addr   = (uint32_t)(uintptr_t)adc_dsp_fft_wcoef;
	} else {
		f.window_enable = FFT_WINDOW_DISABLE;
		f.window_addr   = 0u;
	}
	fft_init(&f);
	return true;
}

/* Reduce the FFT block's complex output to the published bins, per the
 * chain's output format, and bump the frame seq. */
static void adc_dsp_fft_publish(void)
{
	const uint16_t n = adc_dsp_fft_points;
	if (adc_dsp_fft_outfmt == 0u) { /* COMPLEX: re,im interleaved, 2N */
		for (uint16_t i = 0u; i < n * 2u; ++i)
			adc_dsp_fft_bins[i] = adc_dsp_fft_out[i];
		adc_dsp_fft_nbins = (uint16_t)(n * 2u);
	} else { /* MAGNITUDE (N) or MAGNITUDE_ONESIDED (N/2+1) */
		const uint16_t nb = (adc_dsp_fft_outfmt == 2u) ? (uint16_t)(n / 2u + 1u) : n;
		for (uint16_t i = 0u; i < nb; ++i) {
			const float re      = adc_dsp_fft_out[i * 2u];
			const float im      = adc_dsp_fft_out[i * 2u + 1u];
			adc_dsp_fft_bins[i] = __builtin_sqrtf(re * re + im * im);
		}
		adc_dsp_fft_nbins = nb;
	}
	adc_dsp_fft_seq++;
}

/* Pump the FFT path for stream sid: accumulate new raw samples into the
 * float window; on a full window run the HW FFT and publish. */
static void adc_dsp_pump_fft(uint8_t sid)
{
	adc_stream_state_t *s = &adc_streams[sid];

	if (adc_dsp_fft_owner != (int8_t)sid) {
		if (!adc_dsp_fft_config(s)) return;
		adc_dsp_fft_owner = (int8_t)sid;
		/* pump_raw_read is deliberately NOT rewound here (#70).
		 * chain_bind already seeds it (adc_dsp_chain.c: `s->pump_raw_read
		 * = s->total_read;`) at the moment this stream's chain was
		 * bound; re-seeding it again on every ownership flip is what
		 * converted transient FAC/FFT contention into PERMANENT
		 * starvation -- total_read never advances for an FFT-bound
		 * stream (stream_read bails on dsp_terminal == 3u before
		 * touching it), so this rewind kept resetting the window to the
		 * same frozen value on every pump tick, which never let
		 * adc_dsp_fft_seq leave 0.  UNPROVEN HOST-SIDE: whether the
		 * rewind is needed for a genuine same-stream re-attach (a
		 * stream_end -> chain_release -> later chain_bind on the SAME
		 * sid, where chain_bind's own seed already covers it) is a
		 * question about DMA down-counter semantics and lap-ISR
		 * interleaving that no host harness reproduces -- confirm on a
		 * bench before relying on this. */
	}

	const uint32_t laps          = s->lap_count;
	const uint16_t w             = adc_stream_write_index(s);
	const uint32_t total_written = laps * BRIDGE_ADC_STREAM_RING_SAMPLES + (uint32_t)w;
	int32_t        avail         = (int32_t)(total_written - s->pump_raw_read);
	if (avail <= 0) return;
	if ((uint32_t)avail >= BRIDGE_ADC_STREAM_RING_SAMPLES) {
		s->pump_raw_read = total_written; /* fell behind -> resync, drop partial window */
		adc_dsp_fft_fill = 0u;
		return;
	}

	while (avail-- > 0) {
		const uint16_t ridx = (uint16_t)(s->pump_raw_read % BRIDGE_ADC_STREAM_RING_SAMPLES);
		const uint16_t code = (uint16_t)(s->ring[ridx] & 0x0FFFu);
		s->pump_raw_read++;
		/* code (0..4095) -> float 0..~1.0 */
		adc_dsp_fft_real[adc_dsp_fft_fill++] = (float)code / 4096.0f;
		if (adc_dsp_fft_fill >= adc_dsp_fft_points) {
			fft_calculation_start();
			uint32_t g = 0u;
			while (fft_flag_get(FFT_FLAG_CCF) == RESET && ++g < 1000000u) {
			}
			if (fft_flag_get(FFT_FLAG_CCF) != RESET) adc_dsp_fft_publish();
			adc_dsp_fft_fill = 0u;
		}
	}
}

/* Release the FFT block if this stream owned it (stream_end). */
void adc_dsp_fft_release(uint8_t stream_id)
{
	if (adc_dsp_fft_owner == (int8_t)stream_id) {
		adc_dsp_fft_owner = -1;
		adc_dsp_fft_fill  = 0u;
		adc_dsp_fft_nbins = 0u;
	}
}

/* HAL: read spectrum bins (float32 LE) for a bound FFT stream.  Chunked:
 * the host asks for [bin_offset, bin_offset+max_bins); the reply carries
 * the frame seq so the host detects a frame roll mid-fetch.  Returns
 * NOSUPPORT if the stream isn't FFT-bound, IO before the first frame. */
int bridge_hw_adc_spectrum_read(uint8_t   stream_id,
                                uint16_t  bin_offset,
                                uint8_t   max_bins,
                                uint32_t *seq_out,
                                uint16_t *total_bins_out,
                                uint8_t  *got_bins_out,
                                float    *bins_out)
{
	if (seq_out == 0 || total_bins_out == 0 || got_bins_out == 0 || bins_out == 0) {
		return BRIDGE_HW_ERR_INVAL;
	}
	*got_bins_out = 0u;
	if (stream_id >= BRIDGE_ADC_STREAM_COUNT) return BRIDGE_HW_ERR_RANGE;
	adc_stream_state_t *s = &adc_streams[stream_id];
	if (!s->in_use || !s->dsp_bound || s->dsp_terminal != 3u) return BRIDGE_HW_ERR_NOTIMPL;
	if (adc_dsp_fft_owner != (int8_t)stream_id || adc_dsp_fft_seq == 0u) {
		return BRIDGE_HW_ERR_IO; /* no frame yet */
	}

	*seq_out        = adc_dsp_fft_seq;
	*total_bins_out = adc_dsp_fft_nbins;
	if (bin_offset >= adc_dsp_fft_nbins) return BRIDGE_HW_OK; /* past the end */

	uint16_t remain = (uint16_t)(adc_dsp_fft_nbins - bin_offset);
	uint8_t  emit   = (remain < max_bins) ? (uint8_t)remain : max_bins;
	for (uint8_t i = 0u; i < emit; ++i)
		bins_out[i] = adc_dsp_fft_bins[bin_offset + i];
	*got_bins_out = emit;
	return BRIDGE_HW_OK;
}
